docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-20 Mon 11:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Adam Fallon" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org50ca4fd" class="outline-2">
<h2 id="org50ca4fd">adamfallon.com</h2>
<div class="outline-text-2" id="text-org50ca4fd">
<p>
Welcome to my website.
</p>

<p>
I am a software engineer, living in London.
</p>

<p>
Currently working on something in stealth. Ex-Trainline, Rightmove.
</p>
</div>
<div id="outline-container-org02dd927" class="outline-3">
<h3 id="org02dd927">Projects</h3>
<div class="outline-text-3" id="text-org02dd927">
</div>
<div id="outline-container-org57dde5d" class="outline-4">
<h4 id="org57dde5d"><a href="https://whathappenedin2007.com/">What Happened in 2007?</a></h4>
<div class="outline-text-4" id="text-org57dde5d">
<p>
This website charts many detrimental trends since the dawn of the iPhone, including teen depression, lost productivity, increase in sleep disorders, and loneliness.
</p>
</div>
</div>
</div>
<div id="outline-container-org650360f" class="outline-3">
<h3 id="org650360f">Posts</h3>
<div class="outline-text-3" id="text-org650360f">
</div>
<div id="outline-container-orgdc2c009" class="outline-4">
<h4 id="orgdc2c009"><a href="https://archive.ph/B9gBD">Using LLM as a Translator</a></h4>
<div class="outline-text-4" id="text-orgdc2c009">
<p>
Travel disruptions can be one of the most frustrating moments customers of Trainline.
Miscommunication, especially when traveling internationally, amplifies these challenges.
At Trainline, we identified a critical gap: disruption messages aren’t translated for customers outside their native language.
</p>
</div>
</div>
<div id="outline-container-org5334322" class="outline-4">
<h4 id="org5334322"><a href="https://archive.ph/4P2R5">Searching a data breach with ElasticSearch</a></h4>
<div class="outline-text-4" id="text-org5334322">
<p>
Facebook managed to somehow degrade user trust further when 500m user records showed up online. The breach included users email, location, work place and most concerningly, phone numbers. I was curious if I was affected as I have an account on many of their services.
Thankfully I was not, but after scanning through the files with grep I wondered if I could do it an easier way. So I turned to Elasticsearch.
</p>
</div>
</div>
<div id="outline-container-orgeb5568e" class="outline-4">
<h4 id="orgeb5568e"><a href="https://archive.ph/cHJQU">Recreating YikYak with Postgres</a></h4>
<div class="outline-text-4" id="text-orgeb5568e">
<p>
YikYak was an anonymous social network that used your location to show you posts 5km around you. Users of the app could create new posts and the people around them could view the posts and vote up or down.
</p>
</div>
</div>
<div id="outline-container-orgcb5d613" class="outline-4">
<h4 id="orgcb5d613"><a href="https://archive.ph/qAhSD">On Device Network Logging for iOS</a></h4>
<div class="outline-text-4" id="text-orgcb5d613">
<p>
In the iOS team we noticed that - frequently - when doing release testing, we would come across bugs or issues when interacting with back end services that we didn’t know how to diagnose without some help from another team. This conversation id is critical to diagnosing the issue in a timely fashion, and without it, you are making the process tedious and frustrating for the person helping you. If you don’t have it the ability to debug your issue becomes more difficult.
</p>
</div>
</div>
</div>
<div id="outline-container-org6a41130" class="outline-3">
<h3 id="org6a41130">Support</h3>
<div class="outline-text-3" id="text-org6a41130">
<p>
Here are some causes I care about:
</p>
</div>
<div id="outline-container-org9e087de" class="outline-4">
<h4 id="org9e087de"><a href="https://www.eff.org">EFF</a></h4>
<div class="outline-text-4" id="text-org9e087de">
</div>
<ul class="org-ul">
<li><a id="orgb362eeb"></a>The EFF fights to defend digital privacy, free speech, and innovation<br /></li>
</ul>
</div>
<div id="outline-container-org39de28e" class="outline-4">
<h4 id="org39de28e"><a href="https://www.frame.work">Framework</a></h4>
<div class="outline-text-4" id="text-org39de28e">
</div>
<ul class="org-ul">
<li><a id="orgbb06a1a"></a>Framework makes laptops you can repair yourself.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orge1b20b6" class="outline-3">
<h3 id="orge1b20b6">Links</h3>
<div class="outline-text-3" id="text-orge1b20b6">
<ul class="org-ul">
<li><a href="https://www.linkedin.com/in/adam-fallon-4bb4b1300/">LinkedIn</a></li>
<li><a href="https://github.com/afallon02">Github</a></li>
<li><a href="https://bsky.app/profile/adamfallon.bsky.social">BlueSky</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
